posts/internet-protocol-stack-tcpdump-analysis/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns#" lang="en">
<head>
<meta charset="utf-8">
<meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta http-equiv="x-ua-compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>网络协议的抓包分析 | Hack Note</title>
<meta name="theme-color" content="#04519b">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="/rss.xml">
<link href="/assets/css/minima.min.css" rel="stylesheet" type="text/css">
<link rel="canonical" href="https://blog.wangzhl.com/posts/internet-protocol-stack-tcpdump-analysis/">
<link rel="icon" href="/favicon.ico" sizes="64x64">
<link rel="prev" href="/posts/transmission-control-protocol-2/" title="TCP协议（RFC793）-2-" type="text/html">
<link rel="next" href="/posts/user-datagram-protocol/" title="UDP协议（RFC768）" type="text/html">
<meta name="author" content="Samson Wang">
<meta property="og:site_name" content="Hack Note">
<meta property="og:title" content="网络协议的抓包分析">
<meta property="og:url" content="https://blog.wangzhl.com/posts/internet-protocol-stack-tcpdump-analysis/">
<meta property="og:description" content="本文主要内容是对tcpdump所抓取的数据包进行分析，按照网络协议解出每个字节所代表的含义。
通过前面几篇博客的学习和总结，我对网络协议有了一定的了解，这时需要理论结合实际，使学到的知识记忆更加深刻。





阅读本文需要了解tcp、ip、tcpdump的相关知识，可以参考我之前的文章：


tcp：TCP协议（RFC798）
ip：IP协议（RFC791）
tcpdump：Linux常用命令行">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-11-05T22:19:19+08:00">
<meta property="article:tag" content="ip">
<meta property="article:tag" content="network">
<meta property="article:tag" content="tcp">
<meta property="article:tag" content="tcpdump">
</head>
<body>
  <header class="site-header nav-custom"><div class="wrapper">
      <a class="site-title" rel="author" href="/">Hack Note</a>
      <nav class="site-nav"><input type="checkbox" id="nav-trigger" class="nav-trigger"><label for="nav-trigger">
          <span class="menu-icon">
            <svg viewbox="0 0 18 15" width="18px" height="15px"><use href="/assets/svg/theme.svg#menu-icon"></use></svg></span>
        </label>
        <div class="trigger">
          
            <a class="page-link" href="/">Home</a>
            <a class="page-link" href="/archive/">Archive</a>
            <a class="page-link" href="/tags/">Tags</a>
            <a class="page-link" href="/about/">About</a>

        </div>
      </nav>
</div>
  </header><main class="page-content" aria-label="Content"><div class="wrapper">

    

    
<article class="post h-entry" itemscope="" itemtype="http://schema.org/BlogPosting"><header class="post-header"><h1 class="post-title p-name" itemprop="name headline">网络协议的抓包分析</h1>

    <p class="post-meta">
      
    <time class="dt-published" datetime="2018-11-05T22:19:19+08:00" itemprop="datePublished">Nov 05, 2018</time></p>
  </header><div class="post-content e-content" itemprop="articleBody text">
    <p>
本文主要内容是对tcpdump所抓取的数据包进行分析，按照网络协议解出每个字节所代表的含义。<br>
通过前面几篇博客的学习和总结，我对网络协议有了一定的了解，这时需要理论结合实际，使学到的知识记忆更加深刻。<br></p>

<!-- TEASER_END -->

<p>
阅读本文需要了解tcp、ip、tcpdump的相关知识，可以参考我之前的文章：<br></p>
<ul class="org-ul">
<li>tcp：<a href="/posts/transmission-control-protocol-2/" class="post-url">TCP协议（RFC798）</a><br>
</li>
<li>ip：<a href="/posts/internet-protocol/" class="post-url">IP协议（RFC791）</a><br>
</li>
<li>tcpdump：<a href="/posts/linux-command-examples-tcpdump/" class="post-url">Linux常用命令行指令 - tcpdump</a><br>
</li>
</ul>
<div id="outline-container-org606947e" class="outline-2">
<h2 id="org606947e">抓包</h2>
<div class="outline-text-2" id="text-org606947e">
<p>
这是在实验室环境下的局域网进行抓包，抓包的命令如下。<br></p>
<div class="highlight"><pre><span></span>tcpdump -i any 'dst host 169.10.36.66 port 20014' -XX -nn -vv
</pre></div>

<p>
<b>抓包的结果</b><br>
数据包的基础信息<br></p>
<pre class="example">
15:39:13.865699 IP (tos 0x0, ttl 64, id 36429, offset 0, flags [DF], proto TCP (6), length 57)
   169.10.10.10.47912 &gt; 169.10.36.66.20014:
       Flags [P.], cksum 0x808c (incorrect -&gt; 0x5ebe), seq 1353274499:1353274504, ack 2930227654,
       win 9444, options [nop,nop,TS val 2177524110 ecr 229721019], length 5
</pre>

<p>
数据包的具体内容：使用16进制表示<br></p>
<pre class="example">
0x0000:  0004 0001 0006 000c 29a7 fe3b 0000 0800
0x0010:  4500 0039 8e4d 4000 4006 2c11 a90a 0a0a
0x0020:  a90a 2442 bb28 4e2e 50a9 5483 aea7 b9c6
0x0030:  8018 24e4 808c 0000 0101 080a 81ca 618e
0x0040:  0db1 43bb 107b 007b 1600 0000 0000 0000
0x0050:  0000 0000 0000 0000 00
</pre>
</div>
</div>

<div id="outline-container-org87eae05" class="outline-2">
<h2 id="org87eae05">链路协议分析</h2>
<div class="outline-text-2" id="text-org87eae05">
<p>
最开始的部分是链路层协议<br></p>
<pre class="example">
0004 0001 0006
000c 29a7 fe3b      本机mac地址
0000 0800
</pre>
<p>
其中有6个字节能够看到，存放的是本机的mac地址。<br></p>
</div>
</div>

<div id="outline-container-org77ceb1d" class="outline-2">
<h2 id="org77ceb1d">IP协议分析</h2>
<div class="outline-text-2" id="text-org77ceb1d">
<p>
接下来的部分是IP协议内容，16进程格式表示如下。IP协议部分共有20字节。<br></p>
<pre class="example">
4500 0039 8e4d 4000 4006 2c11 a90a 0a0a
a90a 2442
</pre>

<p>
详细的协议分析<br></p>
<pre class="example">
4             ver
5             ihl
00            tos
0039          totoal length
8e4d          id
4000          flags [0:3] frag offset[4:15]
40            ttl
06            protocol （6-tcp）
2c11          header cksum
a90a 0a0a     src addr
a90a 2442     dst addr
</pre>

<p>
可以从协议中读到：ip协议的版本（ver， version）IPv4。ip协议头长度（ihl， internet header length）为5*32bit，即20字节。服务类型（tos， type of service）中可以读到内容，优先权（precedence）为 <code>000</code> 表示常规（routine），延迟为（delay）为0，吞吐量（throughput）为0，可靠性（reliability）为0。总长度（total length）为0x39字节（57字节），这个长度包括IP协议头和IP中包含的数据。标识flag，按字节 <code>010</code> ，第二字节为 <code>1</code> 表示 <code>DF</code> 不要分包（don't fragment）。最大生存期（TTL，time to live）为64（0x40）秒。协议为6，这是个枚举值，表示IP协议中包含的数据所使用的协议为TCP协议。校验码（cksum，checksum）为0x2c11。源地址（source address）为169.10.10.10。目的地址（destination address）为169.10.36.66。<br></p>
</div>
</div>

<div id="outline-container-org5eb1b68" class="outline-2">
<h2 id="org5eb1b68">TCP协议分析</h2>
<div class="outline-text-2" id="text-org5eb1b68">
<p>
接下来是TCP协议，除去IP协议包头长，则TCP协议的数据为37字节。<br></p>
<pre class="example">
bb28 4e2e 50a9 5483 aea7 b9c6
8018 24e4 808c 0000 0101 080a 81ca 618e
0db1 43bb 107b 007b 16
</pre>

<p>
协议的详细分析<br></p>
<pre class="example">
bb28           src port
4e2e           dst port
50a9 5483      seq
aea7 b9c6      ack
8              data offset
18             ack=1 psh=1
24e4           wnd
808c           chk sum
0000           urg ptr
0101 ... 43bb  opt
107b 007b 16   data
</pre>

<p>
从协议中可以读到：源端口号为47912。目的端口号为20014。序列号为0x50a9 5483。应答码为0xaea7 b9c6。数据偏移量为8*32bit，即32字节，这也表示TCP协议头为32字节，所以能够计算出TCP协议中所包含的数据长度为5字节。应答标识（ACK）为 <code>1</code> 。PSH标识为 <code>1</code> 。窗口大小为0x24e4 。校验码为0x808C。选项（options）有很长的一部分。<br></p>

<p>
需要注意的是尾部16字节的全空。<br></p>

<p>
（全文完）<br></p>
</div>
</div>
  </div>
  
  <ul class="tags-list vertical-center">
<li>
      <a class="badge" href="/tags/ip/" rel="tag">ip</a>
    </li>
    <li>
      <a class="badge" href="/tags/network/" rel="tag">network</a>
    </li>
    <li>
      <a class="badge" href="/tags/tcp/" rel="tag">tcp</a>
    </li>
    <li>
      <a class="badge" href="/tags/tcpdump/" rel="tag">tcpdump</a>
    </li>
  </ul></article><ul class="post-pager hidden-print">
<li class="previous">
      <a href="/posts/transmission-control-protocol-2/" rel="prev">Previous post
        <br><span>TCP协议（RFC793）-2-</span>
      </a>
    </li>
    <li class="next">
      <a href="/posts/user-datagram-protocol/" rel="next">Next post
        <br><span>UDP协议（RFC768）</span>
      </a>
    </li>
  </ul>
<section class="comments hidden-print"><div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="samsonwang-blog",
            disqus_url="https://blog.wangzhl.com/posts/internet-protocol-stack-tcpdump-analysis/",
        disqus_title="\u7f51\u7edc\u534f\u8bae\u7684\u6293\u5305\u5206\u6790",
        disqus_identifier="_cache/archives/2018/internet-protocol-stack-tcpdump-analysis.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


  </section><script>var disqus_shortname="samsonwang-blog";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script>
</div>
  </main><footer class="site-footer h-card"><div class="wrapper">
      <div class="footer-col-wrapper">

        <div class="footer-col">
          <p class="site-desc">Personal handnote on software development</p>
        </div>

        <div class="footer-col">
          <div class="p-name">Samson Wang</div>
          <div class="copyright">Copyright 2023, all rights reserved.</div>
          <div class="social-links">
            <ul class="social-media-list">
<li><a rel="me" href="/rss.xml">
                <svg class="svg-icon grey"><use href="/assets/svg/social-icons.svg#rss"></use></svg></a></li>
              <li><a rel="nofollow" href="https://github.com/samsonwang">
                <svg class="svg-icon grey"><use href="/assets/svg/social-icons.svg#github"></use></svg></a></li>
              <li><a rel="nofollow" href="https://twitter.com/samsonwangcn">
                <svg class="svg-icon grey"><use href="/assets/svg/social-icons.svg#twitter"></use></svg></a></li>
              <li><a rel="nofollow" href="https://facebook.com/samsonwangcn">
                 <svg class="svg-icon grey"><use href="/assets/svg/social-icons.svg#facebook"></use></svg></a></li>
            </ul>
</div>

        </div>

      </div>

    </div>

  </footer><div id="scroll-top" title="back to top">
  <div id="scroll-top-arrow"></div>
  <div id="scroll-top-stick"></div>
</div>


      <script src="/assets/js/lazyload.min.js"></script><script src="/assets/js/minima.min.js"></script><!-- google adsense --><script data-ad-client="ca-pub-6303134192857919" async src="https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js"></script><!-- Google Analytics - Global site tag (gtag.js) --><script async src="https://www.googletagmanager.com/gtag/js?id=UA-108507797-1"></script><script>
  window.dataLayer = window.dataLayer || [];
  function gtag(){dataLayer.push(arguments);}
  gtag('js', new Date());
  gtag('config', 'UA-108507797-1');
</script><!-- baidu tongji --><script>
var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "https://hm.baidu.com/hm.js?1dcffb5494ab56e69005c957d7320ad1";
  var s = document.getElementsByTagName("script")[0];
  s.parentNode.insertBefore(hm, s);
})();
</script>
</body>
</html>
